Revit 2021.1 API
Units.GetModifiableUnitTypes Method
 Gets all unit types for which the default FormatOptions can be modified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetModifiableSpecs()` method instead.")]
public static IList<UnitType> GetModifiableUnitTypes()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetModifiableSpecs()` method instead.")> _
Public Shared Function GetModifiableUnitTypes As IList(Of UnitType)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetModifiableSpecs()` method instead.")]
public:
static IList<UnitType>^ GetModifiableUnitTypes()
Return Value
 The unit types for which the FormatOptions can be modified.
Remarks
 The Units class stores a FormatOptions object for every valid unit type, but not all of them can be directly modified. Some, like UT_Number and UT_SiteAngle, have fixed definitions. Others have definitions which are automatically derived from other unit types. For example, UT_SheetLength is derived from UT_Length and UT_ForceScale is derived from UT_Force.
See Also
Units Class
Autodesk.Revit.DB Namespace